app/views/users/index.html.erb

           </div>
          <% @searches = Search.where('search_domain=? and user_id=?', "Privatpersonen", current_user.id) %>
---
SELECT "searches".* FROM "searches" WHERE (search_domain='privatpersonen' and user_id=1)