app/views/users/show.html.erb

        <% when "personen_projekte" %>
          <%= build_medialist2(@user.mobjects.where('mtype=? and parent=?',"projekte",0), "mobjects", nil) %>
---
SELECT "mobjects".* FROM "mobjects" WHERE (mtype='projekte' and id IN (NULL))

                   <% when "alles" %>
                     <% @timetracks = Timetrack.select("mobject_id").where('user_id=? and costortime=?', @user.id, @c_scope).distinct %>
                   <% when "Datum" %>
                     <% @timetracks = Timetrack.select("mobject_id").where('user_id=? and costortime=? and datum=?', @user.id, @c_scope, @c_datum.to_date).distinct %>
---
SELECT mobject_id, sum(amount) as sum FROM "timetracks" WHERE (user_id=2 and costortime='aufwand' and datum >='2017-01-01' and datum <='2017-12-31') GROUP BY "timetracks"."mobject_id"
SELECT date(datum) as gdate, sum(amount) as sum FROM "timetracks" WHERE (user_id=2 and costortime='aufwand' and mobject_id=2 and datum >='2017-07-01' and datum <='2017-07-31') GROUP BY "timetracks"."datum" ORDER BY datum

                      <div>
                        <%= header((I18n.t :projekte) + Mobject.find(t.mobject_id).name, false) %>
                        <% if Madvisor.where('mobject_id=? and role=?', t.mobject_id, t.mobject.mtype).count > 0 %>
---
SELECT  "mobjects".* FROM "mobjects" WHERE "mobjects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "madvisors".* FROM "madvisors" WHERE "madvisors"."user_id" = ? AND (role='projekte')  [["user_id", 2]]
SELECT COUNT(*) FROM "madvisors" WHERE (mobject_id=2 and role='projekte')

                          <tbody>
                          <% @activities = Timetrack.where('user_id=? and costortime=? and datum=?', @user.id, @c_scope, @c_datum).order(datum: :desc) %>
---
SELECT "timetracks".* FROM "timetracks" WHERE (user_id=2 and costortime='aufwand' and datum >='2017-07-01' and datum <='2017-07-31') ORDER BY "timetracks"."datum" DESC

                              <td><%= a.datum.strftime('%d-%m-%Y') %></td>
                              <td><%= showFirstImage2(:small, Mobject.find(a.mobject_id),Mobject.find(a.mobject_id).mdetails) %></td>
---
SELECT  "mdetails".* FROM "mdetails" WHERE "mdetails"."mobject_id" = ? ORDER BY "mdetails"."id" ASC LIMIT ?  [["mobject_id", 1], ["LIMIT", 1]]

                          <% plans = [] %>
                          <% @plannings = Planning.where('mobject_id=? and user_id=? and costortime=? and jahr=?', w.id, @user.id, @c_scope, @c_year.to_s) %>
---
SELECT "plannings".* FROM "plannings" WHERE (mobject_id=2 and user_id=1 and costortime='aufwand' and jahr='2017')

                          <tbody>
                          <% @plannings = Planning.where('user_id=? and costortime=?', @user.id, @c_scope).order(jahrmonat: :desc) %>
---
SELECT "plannings".* FROM "plannings" WHERE (user_id=1 and costortime='kosten') ORDER BY "plannings"."jahrmonat" DESC

                        <td>
                          <% @user2 = User.find(ca.user_id2) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

          <div class="panel-body">
            <%= build_medialist2(Company.where('partner=?',true), "nopartners", hash) %>
---
SELECT "companies".* FROM "companies" WHERE "companies"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "companies" WHERE "companies"."user_id" = ?  [["user_id", 1]]

          <% end %>
          <%= build_medialist2(Appparam.where('info=?', "payable"), "appparams", "user") %>
---
SELECT "appparams".* FROM "appparams" WHERE (domain='dskampagnen')

          <% when "alles" %>
            <% @tts = Timetrack.select("jahrmonat as gdate, sum(amount) as sum").where('user_id=? and costortime=? and mobject_id=?', @user.id, @c_scope, t.mobject_id).group("jahrmonat").order("gdate") %>
---
SELECT jahrmonat as gdate, sum(amount) as sum FROM "timetracks" WHERE (user_id=1 and costortime='aufwand' and mobject_id=2 and datum >='2017-01-01' and datum <='2017-12-31') GROUP BY "timetracks"."jahrmonat" ORDER BY gdate