app/views/home/index10.html.erb

        <% if f.object_name == "User" %>
          <% it = User.find(f.object_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]