app/views/companies/index.html.erb

           </div>
          <% @searches = Search.where('search_domain=? and user_id=?', "Institutionen", current_user.id) %>
---
SELECT "searches".* FROM "searches" WHERE (search_domain='institutionen' and user_id=1)