app/views/companies/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
          <div class="panel-body">
            <% @company.user.favourits.each do |f| %>

SELECT COUNT(*) FROM "partner_links" WHERE "partner_links"."company_id" = ?  [["company_id", 1]]
---
          <div class="panel-body">
            <% @company.partner_links.each do |pl| %>