app/views/mobjects/_form.html.erb

                    <% when "Ausschreibungen", "Stellenanzeigen" %>
                      <%= f.collection_select :mcategory_id, Mcategory.where('ctype=?',"Branche").order(:name), :id, :name, {}, :readonly => true, class:"form-control" %>
---
SELECT "mcategories".* FROM "mcategories" WHERE (ctype='projekte') ORDER BY "mcategories"."name" ASC