app/views/mobjects/index.html.erb

        <% if @msubtype %>
          <% @searches = Search.where('search_domain=? and user_id=? and mtype=? and msubtype=?', :objekte, current_user.id, @mtype, @msubtype) %>
---
SELECT "searches".* FROM "searches" WHERE (search_domain='objekte' and user_id=1 and mtype='projekte')