app/views/mobjects/show.html.erb

SELECT date(created_at) as datum, count(amount) as summe FROM "mstats" WHERE (mobject_id = 1) GROUP BY date(created_at)
---
                  <% if @mobject.mstats != nil %>
                    <% ist  = @mobject.mstats.sum(:amount) %>

SELECT "mobjects".* FROM "mobjects" WHERE (parent=1) ORDER BY "mobjects"."created_at" DESC
---
                    <div class="panel-body">
                      <%= build_medialist2(Mobject.where('parent=?',@mobject.id).order(created_at: :desc), "mobjects", "User") %>

SELECT "mdetails".* FROM "mdetails" WHERE "mdetails"."mobject_id" = ? AND (mtype='details')  [["mobject_id", 1]]
---
          <div class="panel-body">
            <%= build_medialist2(@mobject.mdetails.where('mtype=?', "Details"), "mdetails", nil) %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
              <% useranswers.each do |us| %>
                <%= showImage2(:small, User.find(us), true) %>

SELECT "madvisors".* FROM "madvisors" WHERE "madvisors"."mobject_id" = ? AND (role='projekte')  [["mobject_id", 2]]
---
          <div class="panel-body">
            <%= build_medialist2(@mobject.madvisors.where('role=?', @mobject.mtype), "madvisors", "User") %>

SELECT  jahrmonat, sum(amount) as summe FROM "timetracks" WHERE (mobject_id=1 and costortime='aufwand' and datum>='2017-01-01' and datum<='2017-12-31') GROUP BY "timetracks"."jahrmonat" ORDER BY "timetracks"."jahrmonat" DESC LIMIT ?  [["LIMIT", 1]]
SELECT  jahrmonat, sum(amount) as summe FROM "plannings" WHERE (mobject_id=1 and costortime='aufwand' and jahr='2017') GROUP BY "plannings"."jahrmonat" ORDER BY "plannings"."jahrmonat" DESC LIMIT ?  [["LIMIT", 1]]
---
            <% if @c_mode == "alles" %>
              <% @tts = Timetrack.select("jahrmonat, sum(amount) as summe").where('mobject_id=? and costortime=?',@mobject.id, @c_scope).group("jahrmonat").order(:jahrmonat) %>
              <% @pts = Planning.select("jahrmonat, sum(amount) as summe").where('mobject_id=? and costortime=?',@mobject.id, @c_scope).group("jahrmonat").order(:jahrmonat) %>

SELECT user_id, sum(amount) as summe FROM "timetracks" WHERE (mobject_id=1 and costortime='aufwand' and datum>='2017-01-01' and datum<='2017-12-31') GROUP BY "timetracks"."user_id"
SELECT user_id, sum(amount) as summe FROM "plannings" WHERE (mobject_id=1 and costortime='aufwand' and jahr='2017') GROUP BY "plannings"."user_id"
---
            <% if @c_mode == "alles" %>
              <% @tts = Timetrack.select("user_id, sum(amount) as summe").where('mobject_id=? and costortime=?',@mobject.id, @c_scope).group("user_id") %>
              <% @pts = Planning.select("user_id, sum(amount) as summe").where('mobject_id=? and costortime=?',@mobject.id, @c_scope).group("user_id") %>

SELECT DISTINCT "timetracks"."user_id" FROM "timetracks" WHERE (mobject_id=1 and costortime='aufwand')
---
                <% @isoall = [] %>
                <% @timetracks = Timetrack.select("user_id").where('mobject_id=? and costortime=?', @mobject.id, @c_scope).distinct %>

SELECT "mobjects".* FROM "mobjects" WHERE (mtype='projekte' and id in (1))
---

            <% @projects = Mobject.where("mtype=?", "Projekte") %>

SELECT "mcalendars".* FROM "mcalendars" WHERE "mcalendars"."mobject_id" = ?  [["mobject_id", 1]]
---
              <body>
                <% @mobject.mcalendars.each do |ca| %>