app/views/searches/_form.html.erb

                        <%= f.label "Branche" %><br/>
                        <%= f.collection_select :mcategory_id, Mcategory.where('ctype=?',"Branche").order(:name), :id, :name, {:include_blank => true}, class:"form-control" %>
---
SELECT "mcategories".* FROM "mcategories" WHERE (ctype='Branche') ORDER BY "mcategories"."name" ASC