app/controllers/companies_controller.rb

SELECT  "companies".* FROM "companies" WHERE (status='OK' and active='t') ORDER BY "companies"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "companies" WHERE (status='OK' and active='t')
SELECT "searches".* FROM "searches" WHERE (search_domain='institutionen' and user_id=1)
SELECT companies.*, (69.09332411348201 * ABS(companies.latitude - 47.5370765) * 0.7071067811865475) + (59.836573914187355 * ABS(companies.longitude - 9.0179162) * 0.7071067811865475) AS distance, CASE WHEN (companies.latitude >= 47.5370765 AND companies.longitude >= 9.0179162) THEN  45.0 WHEN (companies.latitude <  47.5370765 AND companies.longitude >= 9.0179162) THEN 135.0 WHEN (companies.latitude <  47.5370765 AND companies.longitude <  9.0179162) THEN 225.0 WHEN (companies.latitude >= 47.5370765 AND companies.longitude <  9.0179162) THEN 315.0 END AS bearing FROM "companies" WHERE (companies.latitude BETWEEN 47.39234471688915 AND 47.68180828311085 AND companies.longitude BETWEEN 8.803534622717349 AND 9.232297777282652) ORDER BY distance ASC
---
  def index

    @controller_name = controller_name

    if params[:page]
      session[:page] = params[:page]
    end

    @companies = Company.search(params[:filter_id], params[:search]).order(created_at: :desc).page(params[:page]).per_page(10)
    @companz = @companies.count
   counter = 0
   @locs = []
   @wins = []
   @companies.each do |c|

SELECT COUNT(*) FROM "partner_links" WHERE "partner_links"."company_id" = ? AND (active='t')  [["company_id", 1]]
---
  def show
     if params[:topic]
       @topic = params[:topic]
     else
       @topic = "institutionen_info"
     end

    if params[:camp_id]
      @campaign = SignageCamp.find(params[:camp_id])
    end

    @stats = [["Aktivtäten","Anzahl"]]
    @stats << ["Projekte/Tasks", @company.mobjects.where('mtype=?','projekte').count ]
    @stats << ["Werbekampagnen", @company.mobjects.where('mtype=?','kampagnen').count ]
    @stats << ["Werbestandorte", @company.mobjects.where('mtype=?','standorte').count ]
    @stats << ["Publikationen", @company.mobjects.where('mtype=?','publikationren').count ]
    @stats << ["Umfragen", @company.mobjects.where('mtype=?','umfragen').count ]
    @stats << ["Innovationswettbewerbe", @company.mobjects.where('mtype=?','innovationswettbewerbe').count ]
    @stats << ["Veranstaltungen", @company.mobjects.where('mtype=?','veranstaltungen').count ]
    @stats << ["Partnerlinks", @company.partner_links.count ]

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    @array_s = @company.build_stats(@array_s, @company.mstats, "crowdfunding Beitraege" )            if false
    @array_s = @company.build_stats(@array_s, @company.customers, "kundenstatus" )
    @array_s = @company.build_stats(@array_s, @company.transactions.where('ttype=?', "payment"), "transaktionen" )
    @array_s = @company.build_stats(@array_s, Email.where('m_to=? or m_from=?', @company.user.id, @company.user.id), "nachrichten" )

SELECT  "companies".* FROM "companies" WHERE (partner='t' and name='Thurgauer Kantonalbank') ORDER BY "companies"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def set_company
      @company = Company.find(params[:id])