app/controllers/home_controller.rb

def index10
  if user_signed_in?

    if params[:day]
      @n = params[:day].to_i
    else
      @n=1
    end

    # follow Tickets
    @usertickets = UserTicket.where('user_id=? and (status=? or status=?) and created_at>=?', current_user.id, "übergeben", "persönlich", @n.day.ago).order(created_at: :desc)

    # follow Favoriten
    @favourits = current_user.favourits.where('created_at>=?',@n.day.ago).order(created_at: :desc)

    # follow Termine
    @appointments = Appointment.where('user_id1=? and created_at>=?', current_user.id, @n.day.ago ).order(created_at: :desc)

    # follow Transaktionen
    @transactions = current_user.transactions.where('created_at>=?', @n.day.ago ).order(created_at: :desc)

    @customers = current_user.customers.order(created_at: :desc)

    # follow eMails
    @emails  = Email.where('m_to=? and created_at>=?', current_user.id, @n.day.ago ).order(created_at: :desc)

    # follow Objects from Favouriten
    @mobjects = current_user.mobjects.order(created_at: :desc)

    # follow Searches
    @searches = current_user.searches.order(created_at: :desc)
---
SELECT "user_tickets".* FROM "user_tickets" WHERE (user_id=1 and (status='übergeben' or status='persönlich') and created_at>='2017-06-30 16:09:26.906880') ORDER BY "user_tickets"."created_at" DESC
SELECT "favourits".* FROM "favourits" WHERE "favourits"."user_id" = ? AND (created_at>='2017-06-30 16:09:26.909802') ORDER BY "favourits"."created_at" DESC  [["user_id", 1]]
SELECT "appointments".* FROM "appointments" WHERE (user_id1=1 and created_at>='2017-06-30 16:09:26.910334') ORDER BY "appointments"."created_at" DESC
SELECT "emails".* FROM "emails" WHERE (m_to=1 and created_at>='2017-06-30 16:09:26.924533') ORDER BY "emails"."created_at" DESC
SELECT "searches".* FROM "searches" WHERE "searches"."user_id" = ? ORDER BY "searches"."created_at" DESC  [["user_id", 1]]