app/controllers/madvisors_controller.rb

  def index
    if params[:search]
      session[:search] = params[:search]
    end
    if params[:mobject_id]
      session[:mobject_id] = params[:mobject_id]
      @mobject = Mobject.find(params[:mobject_id])
    end
    if params[:page]
      session[:page] = params[:page]
    end

    if params[:madvisor_id]
      @madvisor = Madvisor.where('mobject_id=? and user_id=?', session[:mobject_id], params[:madvisor_id]).first
      if !@madvisor
        @madvisor = Madvisor.new
        @madvisor.user_id = params[:madvisor_id]
        @madvisor.mobject_id = session[:mobject_id]
        @madvisor.role = @mobject.mtype
        case @mobject.mtype
          when "Projekte"
            @madvisor.grade = "berechtigt"
          when "Angebote"
            @madvisor.grade = "Berater"
        end
      end
      @madvisor.save
    end
    if params[:senior_madvisor_id]
      @madvisor = Madvisor.where('mobject_id=? and user_id=?', session[:mobject_id], params[:senior_madvisor_id]).first
---
SELECT  "mobjects".* FROM "mobjects" WHERE "mobjects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "madvisors".* FROM "madvisors" WHERE (mobject_id='2' and user_id='1') ORDER BY "madvisors"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "madvisors" ("mobject_id", "user_id", "grade", "rate", "created_at", "updated_at", "role") VALUES (?, ?, ?, ?, ?, ?, ?)  [["mobject_id", 2], ["user_id", 1], ["grade", "berechtigt"], ["rate", 150.0], ["created_at", 2017-07-03 08:50:53 UTC], ["updated_at", 2017-07-03 08:50:53 UTC], ["role", "projekte"]]
SELECT  "users".* FROM "users" WHERE (status='OK' and anonymous='f' and active='t') LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

      end
    end

    @users = User.search(false, session[:search]).page(params[:page]).per_page(10)
---
SELECT COUNT(*) FROM "users" WHERE (status='OK' and anonymous='f' and active='t')