app/controllers/mdetails_controller.rb

INSERT INTO "mdetails" ("mobject_id", "mtype", "name", "sequence", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["mobject_id", 1], ["mtype", "details"], ["name", ""], ["sequence", 0], ["description", ""], ["created_at", 2017-07-03 14:27:14 UTC], ["updated_at", 2017-07-03 14:27:14 UTC]]
---
  def create
    @mdetail = Mdetail.new(mdetail_params)
    if @mdetail.save