app/controllers/mobjects_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index

    if params[:edition_id]
      session[:edition_id] = params[:edition_id]
    end

    @controller_name = controller_name

    if params[:set_part_id]
      @anmeldung = current_user.madvisors.where('mobject_id=? and role=?', params[:set_part_id],"eventteilnehmer").first
      if !@anmeldung
        @madvisor = Madvisor.new
        @madvisor.user_id = current_user.id
        @madvisor.mobject_id = params[:set_part_id]
        @madvisor.role = "eventteilnehmer"
        @madvisor.grade = "Teilnehmer"
        @madvisor.save
      end
    end
    if params[:del_part_id]
      @anmeldung = current_user.madvisors.where('mobject_id=? and role=?', params[:del_part_id], "eventteilnehmer").first

SELECT  "mobjects".* FROM "mobjects" WHERE (status='OK' and mtype='projekte' and active='t') ORDER BY "mobjects"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "mobjects" WHERE (status='OK' and mtype='projekte' and active='t')
---
      session[:parent] = nil
    end

    @mobjects = Mobject.search(nil, nil, params[:filter_id], session[:mtype], session[:msubtype], params[:search], params[:parent]).order(created_at: :desc).page(params[:page]).per_page(10)

SELECT COUNT(*) FROM "mdetails" WHERE "mdetails"."mobject_id" = ?  [["mobject_id", 1]]
---
          end

          @wins = @wins + "["
          if u.mdetails.count > 0

SELECT date(created_at) as datum, count(amount) as summe FROM "mstats" WHERE (mobject_id = 1) GROUP BY date(created_at)
---
  def show
    if !params[:topic]
      if @mobject.mtype == "publikationen"
        @topic = "objekte_ausgaben"
      else
        @topic = "objekte_info"
      end
    else
      @topic = params[:topic]
    end

    if params[:edition_id]
      session[:edition_id] = params[:edition_id]
      @edition_id = params[:edition_id]
    end

    if @topic == "objekte_cfstatistik"
      @mobjects_anz = Mstat.select("date(created_at) as datum, count(amount) as summe").where('mobject_id = ?', @mobject.id).group("date(created_at)")

SELECT COUNT(*) FROM "mcalendars" WHERE "mcalendars"."mobject_id" = ?  [["mobject_id", 1]]
SELECT "mcalendars".* FROM "mcalendars" WHERE "mcalendars"."mobject_id" = ?  [["mobject_id", 1]]
---
     counter = 0
     @array = ""
     @cals = @mobject.mcalendars
     @anz = @cals.count
     @cals.each do |c|

SELECT "mdetails".* FROM "mdetails" WHERE "mdetails"."mobject_id" = ? AND (mtype='details')  [["mobject_id", 1]]
---
            @details << h
          end

          @myd = Mdetail.find(params[:d_id])

SELECT  "mobjects".* FROM "mobjects" WHERE "mobjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        @cals.each do |c|

          if @mobject.mtype == "kampagnen"
            @obj = Mobject.find(c.mstandort)

INSERT INTO "mobjects" ("mtype", "msubtype", "mcategory_id", "owner_id", "owner_type", "status", "name", "description", "date_from", "date_to", "time_from", "time_to", "social", "eventpart", "active", "online_pub", "keywords", "homepage", "address1", "address2", "address3", "latitude", "longitude", "risk", "quality", "costinfo", "geo_address", "sum_paufwand_plan", "sum_pkosten_plan", "created_at", "updated_at", "parent") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @mobject = Mobject.new(mobject_params)

    if @mobject.save