app/controllers/plannings_controller.rb

  def create
    @planning = Planning.new(planning_params)

    respond_to do |format|
      if @planning.save
---
INSERT INTO "plannings" ("user_id", "mobject_id", "jahr", "monat", "amount", "created_at", "updated_at", "jahrmonat", "costortime") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)