app/controllers/searches_controller.rb

  def index
    if params[:search_domain]
      @search_domain = params[:search_domain]
    end
    if params[:controller_name]
      @controller_name = params[:controller_name]
    end
    if params[:mtype]
      @mtype = params[:mtype]
    end
    if params[:msubtype]
      @msubtype = params[:msubtype]
    end
    if params[:ticket_id]
      @ticket = Ticket.find(params[:ticket_id])
      @searches = Search.where('ticket_id=?', params[:ticket_id])
      if params[:generate]
        #userticket = UserTicket.where('ticket_id=? and status=?', params[:ticket_id], "Filter Kampagne").destroy_all
        @searches.each do |s|
          @users = User.where(s.build_sql)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]


    else
      if @msubtype
        @searches = Search.where('search_domain=? and user_id=? and mtype=? and msubtype=?', params[:search_domain], current_user.id, @mtype, @msubtype).page(params[:page]).per_page(10)
---
SELECT  "searches".* FROM "searches" WHERE (search_domain='privatpersonen' and user_id=1 and mtype='' and msubtype='') LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "searches" WHERE (search_domain='privatpersonen' and user_id=1 and mtype='' and msubtype='')

  def create
    @search = Search.new(search_params)
    if @search.save
---
INSERT INTO "searches" ("search_domain", "controller", "user_id", "name", "description", "keywords", "mcategory_id", "age_from", "age_to", "distance", "geo_address", "address1", "address2", "address3", "latitude", "longitude", "social", "customer", "amount_from_target", "amount_to_target", "amount_from", "amount_to", "special", "mtype", "msubtype", "counter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @search.update(search_params)
---
UPDATE "searches" SET "address2" = ?, "geo_address" = ?, "updated_at" = ? WHERE "searches"."id" = ?  [["address2", "Weinfelden"], ["geo_address", "Im Roos Weinfelden Thurgau"], ["updated_at", 2017-07-01 16:33:40 UTC], ["id", 3]]

    def set_search
      @search = Search.find(params[:id])
---
SELECT  "searches".* FROM "searches" WHERE "searches"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]