app/controllers/timetracks_controller.rb

  def create
    @timetrack = Timetrack.new(timetrack_params)

    respond_to do |format|
      if @timetrack.save
---
INSERT INTO "timetracks" ("user_id", "mobject_id", "activity", "amount", "datum", "created_at", "updated_at", "jahrmonat", "costortime") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)