app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE (status='OK' and anonymous='f' and active='t') ORDER BY "users"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE (status='OK' and anonymous='f' and active='t')
SELECT "searches".* FROM "searches" WHERE (search_domain='privatpersonen' and user_id=1)
SELECT users.*, (69.09332411348201 * ABS(users.latitude - 47.5370765) * 0.7071067811865475) + (59.836573914187355 * ABS(users.longitude - 9.0179162) * 0.7071067811865475) AS distance, CASE WHEN (users.latitude >= 47.5370765 AND users.longitude >= 9.0179162) THEN  45.0 WHEN (users.latitude <  47.5370765 AND users.longitude >= 9.0179162) THEN 135.0 WHEN (users.latitude <  47.5370765 AND users.longitude <  9.0179162) THEN 225.0 WHEN (users.latitude >= 47.5370765 AND users.longitude <  9.0179162) THEN 315.0 END AS bearing FROM "users" WHERE (users.latitude BETWEEN 47.39234471688915 AND 47.68180828311085 AND users.longitude BETWEEN 8.803534622717349 AND 9.232297777282652) ORDER BY distance ASC
---
  def index
    @controller_name = controller_name
    if params[:page] != nil
      session[:page] = params[:page]
    end
    @filter = params[:filter_id]
    @users = User.search(params[:filter_id],params[:search]).order(created_at: :desc).page(params[:page]).per_page(10)
    @usanz = @users.count

    @locs = []
    @wins = []
    @users.each do |u|

SELECT  "user_positions".* FROM "user_positions" WHERE "user_positions"."user_id" = ? ORDER BY "user_positions"."created_at" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 20]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "user_positions" WHERE "user_positions"."user_id" = ? LIMIT ?) subquery_for_count  [["user_id", 1], ["LIMIT", 20]]
SELECT COUNT(*) FROM "companies" WHERE "companies"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "madvisors" WHERE (mobject_id=2 and role='projekte')
---
  def show

   if params[:topic]
     @topic = params[:topic]
   else
     @topic = "Info"
   end

    case @topic
      when "Info"

        @locs = []
        @wins = []
        @up = @user.user_positions.limit(20).order(created_at: :desc)
        @count = @up.count
        @up.each do |u|
          if u.longitude and u.latitude and u.geo_address
            @locs << [u.user.fullname, u.latitude, u.longitude]
            @wins << ["<h3>" + u.created_at.strftime("%d.%m.%Y") + "</h3><p>" + u.geo_address + "</p>"]
          end
        end
        if @locs.length == 0
            @locs << ["Adresse", @user.latitude, @user.longitude]
            @wins << ["<h3> keine weiteren Positionen gespeichert </h3>" + @user.geo_address ]
          end

        @stats = [["Aktivtät","Anzahl"]]
        @stats << ["Institutionen", @user.companies.count]
        @stats << ["Kalendereinträge", Appointment.where('user_id1=? or user_id2=?',@user.id,@user.id).count]
        @stats << ["Angebote", @user.mobjects.where('mtype=?','Angebote').count]
        @stats << ["Ansprechpartner", @user.madvisors.count]

SELECT "madvisors".* FROM "madvisors" WHERE "madvisors"."user_id" = ? AND (role='projekte')  [["user_id", 2]]
SELECT "mobjects".* FROM "mobjects" WHERE (mtype='projekte' and id IN (NULL))
SELECT "appointments".* FROM "appointments" WHERE (app_date='2017-07-01' AND (user_id1=1 OR user_id2=1))
---
        end

        myobs = []
        @user.madvisors.each do |a|
          myobs << a.mobject_id
        end
        @mymobjects = Mobject.where('mtype=? and id IN (?)',"Projekte", myobs)

      when "Kalendereintraege"
        if params[:confirm_id]
          @appoint = Appointment.find(params[:confirm_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
            end
          end
          @array = @array + "textColor: 'white',"
          user = User.find(c.user_id2)

SELECT "favourits".* FROM "favourits" WHERE (user_id=1 and object_name='User')
---

        @locs = []
        @wins = []
        @favourits = Favourit.where('user_id=? and object_name=?', @user.id, "User")

SELECT  "credentials".* FROM "credentials" WHERE "credentials"."user_id" = ? AND (appparam_id=1) ORDER BY "credentials"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---

      when "Zugriffsberechtigungen"
        if params[:credential_id]
          @c = Credential.find(params[:credential_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_user
      @user = User.find(params[:id])