app/controllers/users_controller.rb

      @array_s = ""
      @array_s = @user.build_stats(@array_s, Appointment.where('user_id1=? or user_id2=?',@user.id,@user.id), "Kalendereintraege" )
      @array_s = @user.build_stats(@array_s, @user.companies, "Institutionen" )
      @array_s = @user.build_stats(@array_s, @user.mobjects.where('mtype=?','Angebote'), "Angebote" )
---
SELECT  "companies".* FROM "companies" WHERE (partner='t' and name='Thurgauer Kantonalbank') ORDER BY "companies"."id" ASC LIMIT ?  [["LIMIT", 1]]