app/views/layouts/_advertise.html.erb

			<div class="panel-body">
				<% @p = Company.where('partner=?',true) %>
---
SELECT  "companies".* FROM "companies" WHERE (partner='t' and name='Thurgauer Kantonalbank') ORDER BY "companies"."id" ASC LIMIT ?  [["LIMIT", 1]]