app/views/layouts/_footer.html.erb

                <footer_text>
                <% @partners = Company.where('partner=?','t') %>
---
SELECT "companies".* FROM "companies" WHERE (partner='t')